Revit 2024 API
BuiltInFailures.StairRampFailures.BalusterUpsideDown Property
 Top reference is below Bottom reference for one or more Balusters. These Balusters are not created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId BalusterUpsideDown { get; }
Visual Basic
Public Shared ReadOnly Property BalusterUpsideDown As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ BalusterUpsideDown {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace